#include "datastorage.h"

Datastorage::Datastorage()
{

    Vpolice << (QStringList() << "А123ВС" << "Николай Ефремов" << "Дима Ершов" << "Егор Никитин"
                              << "3" << "+7-900-123-45-67");

    Vpolice << (QStringList() << "В456КМ" << "Алексей Смирнов" << "Иван Козлов" << "Олег Сидоров"
                              << "4" << "+7-901-234-56-78");

    Vpolice << (QStringList() << "М789ОР" << "Михаил Титов" << "Сергей Петров" << "Антон Васильев"
                              << "5" << "+7-902-345-67-89");

    Vpolice << (QStringList() << "С234ТУ" << "Артём Зайцев" << "Роман Ильин" << "Владимир Орлов"
                              << "5" << "+7-903-456-78-90");

    Vpolice << (QStringList() << "К321ЕР" << "Павел Николаев" << "Евгений Фёдоров" << "Григорий Максимов"
                              << "3" << "+7-904-567-89-01");

    Vpolice << (QStringList() << "Р654НА" << "Тимур Белов" << "Данил Соколов" << "Константин Афанасьев"
                              << "4" << "+7-905-678-90-12");

    Vpolice << (QStringList() << "Т777КХ" << "Игорь Лебедев" << "Василий Крылов" << "Степан Романов"
                              << "5" << "+7-906-789-01-23");

    Vmch << (QStringList() << "X111AA" << "Станислав Мельников" << "Юрий Павлов" << "Максим Фролов"
                           << "4" << "+7-910-111-22-33");

    Vmch << (QStringList() << "Y222BB" << "Денис Орлов" << "Андрей Никитин" << "Пётр Сафронов"
                           << "3" << "+7-911-222-33-44");

    Vmch << (QStringList() << "Z333CC" << "Борис Игнатов" << "Леонид Белов" << "Герман Титов"
                           << "4" << "+7-912-333-44-55");

    Vmch << (QStringList() << "V444DD" << "Руслан Морозов" << "Аркадий Зимин" << "Сергей Климов"
                           << "3" << "+7-913-444-55-66");

    Vmch << (QStringList() << "W555EE" << "Олег Харитонов" << "Виталий Грачёв" << "Александр Левин"
                           << "4" << "+7-914-555-66-77");

    Vmch << (QStringList() << "Q666FF" << "Кирилл Тарасов" << "Егор Захаров" << "Даниил Мухин"
                           << "5" << "+7-915-666-77-88");

    Vmch << (QStringList() << "Q644АF" << "Никита Тарасов" << "Кирилл Еванин" << "Алексей Зелёный"
                           << "4" << "+7-915-666-77-55");

    Vfire << (QStringList() << "F111AA" << "Алексей Игнатов" << "Григорий Павленко" << "Николай Мищенко"
                            << "3" << "+7-920-111-22-33");

    Vfire << (QStringList() << "F222BB" << "Владимир Гусев" << "Артём Козин" << "Сергей Добров"
                            << "3" << "+7-921-222-33-44");

    Vfire << (QStringList() << "F333CC" << "Илья Круглов" << "Антон Титов" << "Фёдор Орлов"
                            << "4" << "+7-922-333-44-55");

    Vfire << (QStringList() << "F444DD" << "Роман Белов" << "Игорь Платонов" << "Тимур Ковалев"
                            << "4" << "+7-923-444-55-66");

    Vfire << (QStringList() << "F555EE" << "Даниил Афанасьев" << "Юрий Николаев" << "Михаил Чистов"
                            << "5" << "+7-924-555-66-77");

    Vfire << (QStringList() << "F666FF" << "Артемий Жуков" << "Виталий Савин" << "Павел Князев"
                            << "3" << "+7-925-666-77-88");

    Vfire << (QStringList() << "F777GG" << "Константин Белов" << "Евгений Морозов" << "Андрей Зуев"

                            << "4" << "+7-926-777-88-99");

    Vambulance << (QStringList() << "A101AA" << "Иван Смирнов" << "Алексей Михайлов" << "Денис Гусев"
                                 << "3" << "+7-901-101-10-10");

    Vambulance << (QStringList() << "B202BB" << "Сергей Воронов" << "Анна Крылова" << "Мария Соколова"
                                 << "4" << "+7-902-202-20-20");

    Vambulance << (QStringList() << "C303CC" << "Елена Шестакова" << "Николай Гринёв" << "Павел Андреев"
                                 << "5" << "+7-903-303-30-30");

    Vambulance << (QStringList() << "D404DD" << "Виктор Тихонов" << "Александр Жуков" << "Наталья Орлова"
                                 << "4" << "+7-904-404-40-40");

    Vambulance << (QStringList() << "E505EE" << "Ярослав Егоров" << "Василиса Артемьева" << "Светлана Дьякова"
                                 << "3" << "+7-905-505-50-50");

    Vambulance << (QStringList() << "F606FF" << "Даниил Савченко" << "Оксана Чернова" << "Людмила Зверева"
                                 << "4" << "+7-906-606-60-60");

    Vambulance << (QStringList() << "G707GG" << "Григорий Белов" << "Татьяна Кузнецова" << "Леонид Богданов"
                                 << "3" << "+7-907-707-70-70");

    Vincidents << (QStringList() << "51.532936"
                                 << "46.019057"
                                 << "Саратов"
                                 << "Площадь Кирова"
                                 << "0.2"
                                 << "Утечка газа"
                                 << "Сложный"
                                 << "Принят"
                                 << "Анна Смирнова"
                                 << "+7-912-345-67-89"
                                 << "112");

    Vincidents << (QStringList() << "51.538805" // Саратовский государственный университет
                                 << "46.010168"
                                 << "Саратов"
                                 << "СГУ"
                                 << "0.5"
                                 << "Пожар"
                                 << "Сложный"
                                 << "Принят"
                                 << "Дмитрий Иванов"
                                 << "+7-913-456-78-90  "
                                 << "101");

    Vincidents << (QStringList() << "51.534197" // Саратовский академический театр драмы
                                 << "46.001521"
                                 << "Саратов"
                                 << "Театр драмы"
                                 << "0.6"
                                 << "Обрушение здания"
                                 << "Средний"
                                 << "Принят"
                                 << "Мария Соколова"
                                 << "+7-914-567-89-01"
                                 << "103-112");

    Vincidents << (QStringList() << "51.532208" // Саратовский художественный музей
                                 << "46.035263"
                                 << "Саратов"
                                 << "Художественный музей"
                                 << "0.6"
                                 << "Пожар"
                                 << "Сложный"
                                 << "Принят"
                                 << "Сергей Петров"
                                 << "+7-915-678-90-12"
                                 << "101");

    Vincidents << (QStringList() << "51.533893" // Саратовский цирк имени братьев Никитиных
                                 << "46.021211"
                                 << "Саратов"
                                 << "Цирк имени братьев Никитиных"
                                 << "0.7"
                                 << "Нападение животного"
                                 << "Сложный"
                                 << "Принят"
                                 << "Ольга Кузнецова"
                                 << "+7-916-789-01-23"
                                 << "102-103");

    Vincidents << (QStringList() << "51.518355" // Саратовский зоопарк
                                 << "45.996948"
                                 << "Саратов"
                                 << "Саратовский зоопарк"
                                 << "1.5"
                                 << "Нападение животного"
                                 << "Сложный"
                                 << "Принят"
                                 << "Алексей Попов"
                                 << "+7-917-890-12-34"
                                 << "102-103");

    Vincidents << (QStringList() << "51.526052" // Саратовский вокзал
                                 << "46.055114"
                                 << "Саратов"
                                 << "Саратовский вокзал"
                                 << "2"
                                 << "Ограбление"
                                 << "Сложный"
                                 << "Принят"
                                 << "Екатерина Васильева"
                                 << "+7-918-901-23-45"
                                 << "102");

    Vincidents << (QStringList() << "51.558183" //  Аэропорт
                                 << "46.031342"
                                 << "Саратов"
                                 << "Саратовский аэропорт"
                                 << "20"
                                 << "Задымление"
                                 << "Средний"
                                 << "Принят"
                                 << "Игорь Морозов"
                                 << "+7-919-012-34-56"
                                 << "101");

    Vincidents << (QStringList() << "51.54243" // Саратовский парк Победы
                                 << "46.06063"
                                 << "Саратов"
                                 << "Парк Победы"
                                 << "1.5"
                                 << "Ограбление"
                                 << "Сложный"
                                 << "Принят"
                                 << "Наталья Федорова"
                                 << "+7-920-123-45-67"
                                 << "102");

    Vincidents << (QStringList() << "51.498551" // Энгельск
                                 << "46.119876"
                                 << "Саратовская область"
                                 << "Энгельс"
                                 << "10"
                                 << "Пожар"
                                 << "Средний"
                                 << "Принят"
                                 << "Наталья Федорова"
                                 << "+7-920-123-45-67"
                                 << "101");

    Vincidents << (QStringList() << "52.00648" // Город Балаково
                                 << "47.81411"
                                 << "Саратовская область"
                                 << "Балаково"
                                 << "175"
                                 << "Затопление"
                                 << "Лёгкий"
                                 << "Принят"
                                 << "Павел Лебедев"
                                 << "+7-921-234-56-78"
                                 << "112");

    Vincidents << (QStringList() << "52.04571" // Город Вольск
                                 << "47.38637"
                                 << "Саратовская область"
                                 << "Вольск"
                                 << "146"
                                 << "Авария"
                                 << "Средний"
                                 << "Принят"
                                 << "Татьяна Новикова"
                                 << "+7-922-345-67-89"
                                 << "102-103");

    Vincidents << (QStringList() << "51.707735" // Город Маркс
                                 << "46.744734"
                                 << "Саратовская область"
                                 << "Маркс"
                                 << "63"
                                 << "Обрушение здания"
                                 << "Сложный"
                                 << "Принят"
                                 << "Виктор Сергиев"
                                 << "+7-923-456-78-90"
                                 << "103-112");

    Vincidents << (QStringList() << "51.024324" // Город Красноармейск
                                 << "45.696682"
                                 << "Саратовская область"
                                 << "Красноармейск"
                                 << "80"
                                 << "Обрушение здания"
                                 << "Сложный"
                                 << "Принят"
                                 << "Светлана Виноградова"
                                 << "+7-924-567-89-01"
                                 << "103-112");

    Vincidents << (QStringList() << "51.875428" // Город Аткарск
                                 << "45.000032"
                                 << "Саратовская область"
                                 << "Аткарск"
                                 << "78"
                                 << "Нарушение общественного порядка"
                                 << "Легкий"
                                 << "Принят"
                                 << "Артем Ковалев"
                                 << "+7-925-678-90-12"
                                 << "102");

    Vincidents << (QStringList() << "51.674132" // Город светлый
                                 << "45.624686"
                                 << "Саратовская область"
                                 << "Светлый"
                                 << "41"
                                 << "Пожар"
                                 << "Легкий"
                                 << "Принят"
                                 << "Юлия Тихонова"
                                 << "+7-926-789-01-23"
                                 << "101");

    Vincidents << (QStringList() << "51.671364" // Город Татищиво
                                 << "45.592382"
                                 << "Саратовская область"
                                 << "Татищиво"
                                 << "46"
                                 << "Авария из 5 машин"
                                 << "Средний"
                                 << "Принят"
                                 << "Константин Григорьев"
                                 << "+7-927-890-12-34"
                                 << "102-103");

    Vincidents << (QStringList() << "51.44002" // Энгельск
                                 << "46.12554"
                                 << "Саратовская область"
                                 << "Энгельск"
                                 << "10"
                                 << "Пожар"
                                 << "Средний"
                                 << "Принят"
                                 << "Василиса Белова"
                                 << "+7-928-901-23-45"
                                 << "101");

    Vincidents << (QStringList() << "51.487416" // Ново-Астраханское шоссе
                                 << "45.900589"
                                 << "Саратовская область"
                                 << "Астраханское шоссе"
                                 << "15"
                                 << "Обрушение здания"
                                 << "Средний"
                                 << "Принят"
                                 << "Дарья Захарова"
                                 << "+7-930-123-45-68"
                                 << "103-112");

    Vincidents << (QStringList() << "51.409024" // Станция Анисовка
                                 << "46.082314"
                                 << "Саратовская область"
                                 << "Станция Анисовка"
                                 << "12"
                                 << "Ограбление"
                                 << "Средний"
                                 << "Принят"
                                 << "Дарья Захарова"
                                 << "+7-930-123-45-68"
                                 << "102");

    Vincidents << (QStringList() << "51.37854" // Город Степное
                                 << "46.84294"
                                 << "Саратовская область"
                                 << "Степное"
                                 << "82"
                                 << "Утечка газа"
                                 << "Легкий"
                                 << "Принят"
                                 << "Анна Смирнова"
                                 << "+7-912-345-67-89"
                                 << "112");

    Vincidents << (QStringList() << "51.66043" // Дубки
                                 << "46.05437"
                                 << "Саратов"
                                 << "Дубки"
                                 << "14"
                                 << "Пожар"
                                 << "Средний"
                                 << "Принят"
                                 << "Дмитрий Иванов"
                                 << "+7-913-456-78-90  "
                                 << "101");

    Vincidents << (QStringList() << "51.623159" // Расково
                                 << "46.032243"
                                 << "Саратовская область"
                                 << "Расково"
                                 << "6"
                                 << "Ограбление"
                                 << "Средний"
                                 << "Принят"
                                 << "Мария Соколова"
                                 << "+7-914-567-89-01"
                                 << "102");

    Vincidents << (QStringList() << "51.64583" // Саратовский художественный музей
                                 << "46.00405"
                                 << "Саратовская область"
                                 << "Зоринский"
                                 << "14"
                                 << "Пожар"
                                 << "Сложный"
                                 << "Принят"
                                 << "Сергей Петров"
                                 << "+7-915-678-90-12"
                                 << "101");

    Vincidents << (QStringList() << "51.75846" // Большая каменка
                                 << "45.74754"
                                 << "Саратовская область"
                                 << "Большая каменка"
                                 << "32"
                                 << "Нападение животного"
                                 << "Сложный"
                                 << "Принят"
                                 << "Ольга Кузнецова"
                                 << "+7-916-789-01-23"
                                 << "102-103");

    Vincidents << (QStringList() << "51.577106" // Торговый центр
                                 << "45.971931"
                                 << "Саратов"
                                 << "Торговый центр"
                                 << "3"
                                 << "Ограбление"
                                 << "Легкий"
                                 << "Принят"
                                 << "Батыр Ершов"
                                 << "+7-914-789-01-23"
                                 << "102");

    Vincidents << (QStringList() << "51.590844" // Черниговская улица
                                 << "45.990655"
                                 << "Саратов"
                                 << "Черниговская улица"
                                 << "10"
                                 << "Утечка газа"
                                 << "Сложный"
                                 << "Принят"
                                 << "Батыр Батыров"
                                 << "+7-914-789-11-23"
                                 << "112");

    Vincidents << (QStringList() << "51.541264" // Больницца
                                 << "46.036078"
                                 << "Саратов"
                                 << "Черниговская улица"
                                 << "3"
                                 << "Обрушение здания"
                                 << "Средний"
                                 << "Принят"
                                 << "Акылбек Акылбеков"
                                 << "+7-914-789-31-23"
                                 << "103-112");

    Vincidents << (QStringList() << "51.544046" // Магазин продуктов
                                 << "46.040735"
                                 << "Саратов"
                                 << "Мясницкая улица"
                                 << "4"
                                 << "Ограбление"
                                 << "Средний"
                                 << "Принят"
                                 << "Асылбек Акылбеков"
                                 << "+7-924-789-31-23"
                                 << "102");

    Vincidents << (QStringList() << "51.529532" // Проезжая часть
                                 << "46.027855"
                                 << "Саратов"
                                 << "улица Сакко и Ванцетти"
                                 << "2"
                                 << "Авария из 5 машин"
                                 << "Сложный"
                                 << "Принят"
                                 << "Мурад Акылбеков"
                                 << "+7-926-689-31-23"
                                 << "102-103");

    Vincidents << (QStringList() << "51.533389" // Театральная площадь
                                 << "46.033627"
                                 << "Саратов"
                                 << "Московская улица"
                                 << "1"
                                 << "Нападение животного"
                                 << "Легкий"
                                 << "Принят"
                                 << "Дмитрий Сергеевич"
                                 << "+7-922-689-31-23"
                                 << "102-103");

    Vincidents << (QStringList() << "51.528063" // Педагогический колледж
                                 << "46.031749"
                                 << "Саратов"
                                 << "Улица Сакко и Ванцетти"
                                 << "1"
                                 << "Задымление"
                                 << "Сложный"
                                 << "Принят"
                                 << "Дмитрий Анатольевич"
                                 << "+7-922-682-31-23"
                                 << "101");

    Vincidents << (QStringList() << "51.562899" // Торговый Центр
                                 << "46.028906"
                                 << "Саратов"
                                 << "Улица Жуковского"
                                 << "23"
                                 << "Затопление"
                                 << "Сложный"
                                 << "Принят"
                                 << "Дмитрий Толстой"
                                 << "+7-922-682-33-23"
                                 << "112");

    Vincidents << (QStringList() << "51.565527" // Ботанический сад
                                 << "46.012813"
                                 << "Саратов"
                                 << "Улица Навашинна"
                                 << "25"
                                 << "Нападение животного"
                                 << "Средний"
                                 << "Принят"
                                 << "Алексей Анатольевич"
                                 << "+7-944-677-31-23"
                                 << "102-103");

    Vincidents << (QStringList() << "51.567697" // Жилой дом
                                 << "46.014674"
                                 << "Саратов"
                                 << "Артиллерийская улица"
                                 << "28"
                                 << "Нарушение общественного порядка"
                                 << "Средний"
                                 << "Принят"
                                 << "Максим Йосович"
                                 << "+7-933-111-13-23"
                                 << "102");

    Vincidents << (QStringList() << "51.521328" // Жилой дом
                                 << "45.992289"
                                 << "Саратов"
                                 << "Станционная улица"
                                 << "11"
                                 << "Ограбление"
                                 << "Легкий"
                                 << "Принят"
                                 << "Александр Орлов"
                                 << "+7-915-111-13-23"
                                 << "102");

    Vincidents << (QStringList() << "51.516473" // Общественная остановка
                                 << "46.008444"
                                 << "Саратов"
                                 << "Станционная улица"
                                 << "8"
                                 << "Нарушение общественного порядка"
                                 << "Средний"
                                 << "Принят"
                                 << "Александр Воронцов"
                                 << "+7-915-201-13-23"
                                 << "102");

    Vincidents << (QStringList() << "51.522803" // Медецинский центр
                                 << "46.015753"
                                 << "Саратов"
                                 << "улица Чапаева"
                                 << "7"
                                 << "Задымление"
                                 << "Средний"
                                 << "Принят"
                                 << "Александр Воронов"
                                 << "+7-915-201-03-23"
                                 << "101");

    Vincidents << (QStringList() << "51.524576" // Магазин выпечки
                                 << "46.019765"
                                 << "Саратов"
                                 << "улица Вольская"
                                 << "6"
                                 << "Утечка газа"
                                 << "Легкий"
                                 << "Принят"
                                 << "Иван Воронов"
                                 << "+7-930-201-03-23"
                                 << "112");

    Vincidents << (QStringList() << "51.531454" // Проезжая часть
                                 << "46.046222"
                                 << "Саратов"
                                 << "Московская улица"
                                 << "3"
                                 << "Авария"
                                 << "Сложный"
                                 << "Принят"
                                 << "Иван Иванов"
                                 << "+7-930-530-03-23"
                                 << "102-103");

    Vincidents << (QStringList() << "51.532041" // Проезжая часть
                                 << "46.049371"
                                 << "Саратов"
                                 << "Вознесенская улица"
                                 << "9"
                                 << "Нарушение общественного порядка"
                                 << "Сложный"
                                 << "Принят"
                                 << "Иван Вознесенский"
                                 << "+7-940-530-03-23"
                                 << "102");

    Vincidents << (QStringList() << "51.528215" // Частная парковка
                                 << "46.048473"
                                 << "Саратов"
                                 << "улица Чернышевского"
                                 << "1"
                                 << "Ограбление"
                                 << "Средний"
                                 << "Принят"
                                 << "Никита Вознесенский"
                                 << "+7-943-530-03-23"
                                 << "102");

    Vincidents << (QStringList() << "51.526888" // Проезжая часть
                                 << "46.057724"
                                 << "Саратов"
                                 << "Набережная космонавтов"
                                 << "1"
                                 << "Авария из 5 машин"
                                 << "Сложный"
                                 << "Принят"
                                 << "Артур Вознесенский"
                                 << "+7-943-561-03-23"
                                 << "102-103");

    Vincidents << (QStringList() << "51.528077" // Жилой дом
                                 << "46.059247"
                                 << "Саратов"
                                 << "Валовая улица"
                                 << "2"
                                 << "Обрушение здания"
                                 << "Сложный"
                                 << "Принят"
                                 << "Артур Петров"
                                 << "+7-988-561-03-23"
                                 << "103-112");

    Vincidents << (QStringList() << "51.528450" // Отделение почты
                                 << "46.052917"
                                 << "Саратов"
                                 << "Московская улица"
                                 << "3"
                                 << "Ограбление"
                                 << "Сложный"
                                 << "Принят"
                                 << "Артур Артуров"
                                 << "+7-988-561-03-52"
                                 << "102");

    Vincidents << (QStringList() << "51.531107" // Пешеходная зона
                                 << "46.040976"
                                 << "Саратов"
                                 << "Первомайская улица"
                                 << "6"
                                 << "Ограбление"
                                 << "Средний"
                                 << "Принят"
                                 << "Дмитрий Шаров"
                                 << "+7-916-561-03-52"
                                 << "102");

    Vincidents << (QStringList() << "51.533970" // Продуктовый Магазин
                                 << "46.017617"
                                 << "Саратов"
                                 << "Мирный переулок"
                                 << "11"
                                 << "Задымление"
                                 << "Средний"
                                 << "Принят"
                                 << "Антон Шаров"
                                 << "+7-956-561-03-52"
                                 << "101");

    Vincidents << (QStringList() << "51.551652" // Жилой дом
                                 << "46.014186"
                                 << "Саратов"
                                 << "Большая Садовая Улица"
                                 << "21"
                                 << "Затопление"
                                 << "Легкий"
                                 << "Принят"
                                 << "Виталий Коваленко"
                                 << "+7-970-561-03-52"
                                 << "112");

    Vincidents << (QStringList() << "51.551706" // Запрвка
                                 << "46.019561"
                                 << "Саратов"
                                 << "Большая Садовая Улица"
                                 << "19"
                                 << "Утечка газа"
                                 << "Сложный"
                                 << "Принят"
                                 << "Константин Коваленко"
                                 << "+7-970-561-55-52"
                                 << "112");

    Vincidents << (QStringList() << "51.549551" // Гостиница
                                 << "46.024894"
                                 << "Саратов"
                                 << "улица Ряхова"
                                 << "17"
                                 << "Нарушение общественного порядка"
                                 << "Сложный"
                                 << "Принят"
                                 << "Сергей Диков"
                                 << "+7-978-561-55-52"
                                 << "102");

    Vincidents << (QStringList() << "51.532629" // Библиотека
                                 << "46.024346"
                                 << "Саратов"
                                 << "Вольская улица"
                                 << "5"
                                 << "Пожар"
                                 << "Сложный"
                                 << "Принят"
                                 << "Сергей Ерушин"
                                 << "+7-978-511-55-52"
                                 << "101");

    Vincidents << (QStringList() << "51.53209" // Парк
                                 << "46.00885"
                                 << "Саратов"
                                 << "Советская улица"
                                 << "7"
                                 << "Ограбление"
                                 << "Легкий"
                                 << "Принят"
                                 << "Сергей Дроздов"
                                 << "+7-971-511-55-51"
                                 << "102");

    Vincidents << (QStringList() << "51.525884" // Кафе
                                 << "46.006064"
                                 << "Саратов"
                                 << "Улица Хользунова"
                                 << "11"
                                 << "Затопление"
                                 << "Средний"
                                 << "Принят"
                                 << "Егор Пименов"
                                 << "+7-911-511-55-51"
                                 << "112");

    Vincidents << (QStringList() << "51.520487" // Пешеходная зона
                                 << "46.002578"
                                 << "Саратов"
                                 << "2-я Садовая улица"
                                 << "14"
                                 << "Ограбление"
                                 << "Сложный"
                                 << "Принят"
                                 << "Нарек Пименов"
                                 << "+7-911-509-55-51"
                                 << "102");

    Vincidents << (QStringList() << "51.520200" // Проезжая часть
                                 << "46.007234"
                                 << "Саратов"
                                 << "улица Симбирцева"
                                 << "8"
                                 << "Авария из 5 машин"
                                 << "Сложный"
                                 << "Принят"
                                 << "Артак Пименов"
                                 << "+7-918-509-55-51"
                                 << "102-103");

    Vincidents << (QStringList() << "51.52710" // Жилой дом
                                 << "46.02881"
                                 << "Саратов"
                                 << "Советская улица"
                                 << "6"
                                 << "Утечка газа"
                                 << "Средний"
                                 << "Принят"
                                 << "Дмитрий Щербаков"
                                 << "+7-918-511-55-51"
                                 << "112");

    Vincidents << (QStringList() << "51.52844" // Продуктовый магазин
                                 << "46.02484"
                                 << "Саратов"
                                 << "Советская улица"
                                 << "7"
                                 << "Ограбление"
                                 << "Сложный"
                                 << "Принят"
                                 << "Дмитрий Машков"
                                 << "+7-917-511-55-51"
                                 << "102");

    Vincidents << (QStringList() << "51.526314" // Магазин одежды
                                 << "46.027211"
                                 << "Саратов"
                                 << "Улица Максима Горького"
                                 << "3"
                                 << "Затопление"
                                 << "Легкий"
                                 << "Принят"
                                 << "Дмитрий Берегов"
                                 << "+7-917-511-66-51"
                                 << "112");

    Vincidents << (QStringList() << "51.553704" // Проезжая часть
                                 << "46.031095"
                                 << "Саратов"
                                 << "1-й Магнитный проезд"
                                 << "29"
                                 << "Авария"
                                 << "Легкий"
                                 << "Принят"
                                 << "Александр Зубарев"
                                 << "+7-917-515-66-51"
                                 << "102-103");

    Vincidents << (QStringList() << "51.554925" // Жилой дом
                                 << "46.032597"
                                 << "Саратов"
                                 << "Улица Чапаева"
                                 << "32"
                                 << "Ограбление"
                                 << "Тяжелый"
                                 << "Принят"
                                 << "Вадим Зубарев"
                                 << "+7-928-515-66-51"
                                 << "102");

    sizeBrigades = Vambulance.size() + Vfire.size() + Vmch.size() + Vpolice.size();
}

int Datastorage::getSizeBrigade()
{
    return sizeBrigades;
}
